Revit 2024 API
RebarShapeDefinition.IsPlanar Property
 Reports whether the shape definition lies within a plane: false if a spiral, true in all other cases.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsPlanar { get; }
Visual Basic
Public ReadOnly Property IsPlanar As Boolean
	Get
Visual C++
public:
property bool IsPlanar {
	bool get ();
}
See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace